// pages/divide/recipe/recipe.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    vegs:[
      {'name': '烤鸡蛋', 'conponent': ['生鸡蛋'], 'rst': [20, 0, '生命+5']}, {'name': '烤鸡腿', 'conponent': ['生鸡腿'], 'rst': [30, 0, '0']}, {'name': '烤猪排', 'conponent': ['生猪排'], 'rst': [50, -10, '0']}, {'name': '烤羊排', 'conponent': ['生羊排'], 'rst': [40, -10, '0']}, {'name': '烤牛排', 'conponent': ['生牛排'], 'rst': [40, -10, '0']}, {'name': '烤玉米', 'conponent': ['玉米'], 'rst': [20, -5, '0']}, {'name': '烤蘑菇', 'conponent': ['蘑菇'], 'rst': [10, -5, '0']}, {'name': '烤土豆', 'conponent': ['土豆'], 'rst': [15, -10, '0']}, {'name': '烤南瓜', 'conponent': ['南瓜'], 'rst': [15, -10, '0']}, {'name': '烤香蕉', 'conponent': ['香蕉'], 'rst': [10, 0, '0']}, {'name': '烤苹果', 'conponent': ['苹果'], 'rst': [10, 0, '0']}, {'name': '烤辣椒', 'conponent': ['辣椒'], 'rst': [5, 0, '御寒II']}, {'name': '烤章鱼', 'conponent': ['章鱼'], 'rst': [30, -10, '0']}, {'name': '烤野味', 'conponent': ['野味肉块'], 'rst': [30, -10, '0']}, {'name': '烤洋葱', 'conponent': ['洋葱'], 'rst': [10, 0, '0']}, {'name': '烤笋尖', 'conponent': ['竹笋'], 'rst': [10, 0, '0']}, {'name': '烤青椒', 'conponent': ['青椒'], 'rst': [5, 0, '御寒I']}, {'name': '烤大扇贝', 'conponent': ['大扇贝'], 'rst': [20, 0, '0']}, {'name': '烤小扇贝', 'conponent': ['小扇贝'], 'rst': [10, 0, '0']}, {'name': '烤带鱼（+30）', 'conponent': [], 'rst': [0, 0, '0']}, {'name': '烤三文鱼', 'conponent': ['三文鱼'], 'rst': [10, 0, '0']}, {'name': '烤金枪鱼', 'conponent': ['金枪鱼'], 'rst': [30, 0, '0']}, {'name': '烤红鲤鱼', 'conponent': ['红鲤鱼'], 'rst': [30, 0, '0']}, {'name': '烤绿鲤鱼', 'conponent': ['绿鲤鱼'], 'rst': [30, 0, '0']}, {'name': '烤绿驴鱼', 'conponent': ['绿驴鱼'], 'rst': [30, 0, '0']}, {'name': '烤鳗鱼', 'conponent': ['鳗鱼'], 'rst': [30, 0, '0']}, {'name': '烤鲅鱼', 'conponent': ['鲅鱼'], 'rst': [30, 0, '0']}, {'name': '烤桂鱼', 'conponent': ['桂鱼'], 'rst': [30, 0, '0']}, {'name': '炒瓜子', 'conponent': ['向日葵种子'], 'rst': [10, -5, '0']}, {'name': '草莓酱', 'conponent': ['草莓*2'], 'rst': [40, 0, '0']}, {'name': '草莓派', 'conponent': ['草莓', '小麦'], 'rst': [40, 0, '0']}, {'name': '果酱', 'conponent': ['草莓', '蓝莓'], 'rst': [40, 0, '0']}, {'name': '奶油蘑菇汤', 'conponent': ['蘑菇', '牛奶'], 'rst': [45, 30, '0']}, {'name': '小鸡炖蘑菇', 'conponent': ['蘑菇', '生鸡腿'], 'rst': [45, 10, '0']}, {'name': '南瓜粥', 'conponent': ['南瓜', '小麦', '甘蔗'], 'rst': [50, 20, '0']}, {'name': '红蘑菇汤', 'conponent': ['红蘑菇', '牛奶'], 'rst': [35, 50, '御寒I']}, {'name': '蓝蘑菇汤', 'conponent': ['蓝蘑菇', '牛奶'], 'rst': [35, 50, '祛热I']}, {'name': '辣椒炒肉', 'conponent': ['辣椒', '生猪排'], 'rst': [60, 0, '0']}, {'name': '菠菜炒蛋', 'conponent': ['菠菜', '生鸡蛋', '黄豆'], 'rst': [75, 20, '0']}, {'name': '胡萝卜滑蛋', 'conponent': ['胡萝卜', '烤鸡蛋', '黄豆'], 'rst': [80, 0, '0']}, {'name': '薯条', 'conponent': ['土豆', '番茄'], 'rst': [45, -10, '0']}, {'name': '珍珠奶茶', 'conponent': ['牛奶', '可可豆', '红豆'], 'rst': [40, 30, '0']}, {'name': '经典汉堡', 'conponent': ['小麦', '番茄', '烤鸡腿'], 'rst': [65, 0, '0']}, {'name': '牛排汉堡', 'conponent': ['小麦', '番茄', '烤牛排'], 'rst': [75, 0, '0']}, {'name': '松果蛋糕', 'conponent': ['小麦', '牛奶', '松果'], 'rst': [65, -5, '0']}, {'name': '巧克力牛奶', 'conponent': ['牛奶', '可可豆'], 'rst': [35, 20, '0']}, {'name': '排骨', 'conponent': ['番茄', '生猪排'], 'rst': [45, 35, '0']}, {'name': '羊排汤', 'conponent': ['胡萝卜', '生羊排'], 'rst': [45, 35, '0']}, {'name': '香煎牛排', 'conponent': ['生牛排', '番茄'], 'rst': [50, -5, '0']}, {'name': '椰奶', 'conponent': ['椰子', '牛奶'], 'rst': [35, 40, '0']}, {'name': '西米露', 'conponent': ['椰子', '牛奶', '小麦'], 'rst': [45, 50, '0']}, {'name': '香蕉牛奶', 'conponent': ['牛奶', '香蕉'], 'rst': [40, 10, '0']}, {'name': '章鱼小丸子', 'conponent': ['烤章鱼', '小麦'], 'rst': [60, 0, '0']}, {'name': '糖醋鲤鱼', 'conponent': ['鲤鱼', '甘蔗'], 'rst': [45, 10, '0']}, {'name': '蜂蜜蛋糕', 'conponent': ['牛奶', '小麦', '蜂蜜'], 'rst': [85, -5, '0']}, {'name': '金枪鱼饭团', 'conponent': ['金枪鱼', '小麦'], 'rst': [45, 15, '0']}, {'name': '三文鱼刺身', 'conponent': ['三文鱼', '番茄'], 'rst': [45, 20, '0']}, {'name': '豆沙包', 'conponent': ['小麦', '红豆'], 'rst': [40, 0, '0']}, {'name': '蜜汁烤羊排', 'conponent': ['烤羊排', '蜂蜜'], 'rst': [65, -5, '0']}, {'name': '怪味肉块', 'conponent': ['饲喂肉块', '生牛排'], 'rst': [40, 0, '0']}, {'name': '怪味鱼肉', 'conponent': ['鲶鱼', '河豚'], 'rst': [35, 30, '0']}, {'name': '怪味零食', 'conponent': ['饲喂肉块', '章鱼', '生牛排'], 'rst': [45, 30, '0']}, {'name': '怪味煎肉', 'conponent': ['胡萝卜饲料', '小麦饲料', '土豆饲料'], 'rst': [55, 0, '0']}, {'name': '怪味麻辣肉', 'conponent': ['土豆饲料', '黄豆饲料', '辣椒饲料'], 'rst': [55, 0, '0']}, {'name': '蓝莓酱', 'conponent': ['蓝莓*2'], 'rst': [40, 0, '0']}, {'name': '巧克力酱', 'conponent': ['可可豆*2'], 'rst': [40, 0, '0']}, {'name': '番茄酱', 'conponent': ['番茄*2'], 'rst': [40, 0, '0']}, {'name': '蓝莓派', 'conponent': ['蓝莓', '小麦'], 'rst': [40, 0, '0']}, {'name': '苹果派', 'conponent': ['苹果', '小麦'], 'rst': [50, 0, '0']}, {'name': '黄桃派', 'conponent': ['桃子', '小麦'], 'rst': [40, 0, '0']}, {'name': '蓝莓椰果', 'conponent': ['蓝莓', '椰子'], 'rst': [35, 30, '0']}, {'name': '草莓椰果', 'conponent': ['草莓', '椰子'], 'rst': [40, 25, '0']}, {'name': '巧克力椰果', 'conponent': ['可可豆', '椰子'], 'rst': [40, 20, '0']}, {'name': '松仁玉米粥', 'conponent': ['玉米', '松果', '甘蔗'], 'rst': [50, 20, '0']}, {'name': '蜂蜜鸡蛋羹', 'conponent': ['蜂蜜', '生鸡蛋'], 'rst': [70, 25, '0']}, {'name': '下品菠菜炒蛋', 'conponent': ['菠菜', '生鸡蛋'], 'rst': [50, 0, '0']}, {'name': '西瓜奶茶', 'conponent': ['牛奶', '珍珠', '西瓜'], 'rst': [45, 30, '0']}, {'name': '草莓奶茶', 'conponent': ['牛奶', '珍珠', '草莓'], 'rst': [45, 30, '0']}, {'name': '蓝莓奶茶', 'conponent': ['牛奶', '珍珠', '蓝莓'], 'rst': [50, 30, '0']}, {'name': '葡萄奶茶', 'conponent': ['牛奶', '珍珠', '葡萄'], 'rst': [45, 40, '0']}, {'name': '巧克力奶茶', 'conponent': ['牛奶', '珍珠', '可可豆'], 'rst': [50, 20, '0']}, {'name': '玉米珍珠奶茶', 'conponent': ['牛奶', '珍珠', '玉米'], 'rst': [45, 20, '0']}, {'name': '黄桃奶茶', 'conponent': ['牛奶', '珍珠', '桃子'], 'rst': [40, 35, '0']}, {'name': '猪排汉堡', 'conponent': ['烤猪排', '小麦', '番茄'], 'rst': [70, 0, '0']}, {'name': '野味汉堡', 'conponent': ['烤野味', '小麦', '番茄'], 'rst': [70, 0, '0']}, {'name': '三文鱼汉堡', 'conponent': ['三文鱼', '小麦', '番茄'], 'rst': [85, 10, '0']}, {'name': '金枪鱼汉堡', 'conponent': ['金枪鱼', '小麦', '番茄'], 'rst': [60, 10, '0']}, {'name': '鱿鱼汉堡', 'conponent': ['烤章鱼', '小麦', '番茄'], 'rst': [70, 10, '0']}, {'name': '草莓蛋糕', 'conponent': ['牛奶', '小麦', '草莓'], 'rst': [65, 5, '0']}, {'name': '蓝莓蛋糕', 'conponent': ['牛奶', '小麦', '蓝莓'], 'rst': [65, 5, '0']}, {'name': '草莓牛奶', 'conponent': ['牛奶'], 'rst': [0, 0, '0']}, {'name': '蓝莓牛奶', 'conponent': ['牛奶', '蓝莓'], 'rst': [30, 40, '0']}, {'name': '蛋黄小丸子', 'conponent': ['小麦', '烤鸡蛋'], 'rst': [60, 0, '0']}, {'name': '南瓜小丸子', 'conponent': ['小麦', '南瓜'], 'rst': [45, 0, '0']}, {'name': '牛肉饭团', 'conponent': ['海带', '小麦', '生牛排'], 'rst': [85, 0, '0']}, {'name': '猪肉饭团', 'conponent': ['海带', '小麦', '生猪排'], 'rst': [85, 0, '0']}, {'name': '鸡肉饭团', 'conponent': ['海带', '小麦', '生鸡腿'], 'rst': [75, 0, '0']}, {'name': '牛排饭团', 'conponent': ['海带', '小麦', '烤牛排'], 'rst': [70, 0, '0']}, {'name': '羊排饭团', 'conponent': ['海带', '小麦', '烤羊排'], 'rst': [70, 0, '0']}, {'name': '鸡排饭团', 'conponent': ['海带', '小麦', '烤鸡腿'], 'rst': [65, 0, '0']}, {'name': '猪肉包', 'conponent': ['小麦', '生猪排'], 'rst': [70, 0, '0']}, {'name': '牛肉包', 'conponent': ['小麦', '生牛排'], 'rst': [70, 0, '0']}, {'name': '野味肉包', 'conponent': ['小麦', '野味肉块'], 'rst': [75, 0, '0']}, {'name': '蘑菇小虾包', 'conponent': ['小龙虾', '小麦', '蘑菇'], 'rst': [85, 0, '0']}, {'name': '红菇小虾包', 'conponent': ['小龙虾', '小麦', '红蘑菇'], 'rst': [80, 0, '0']}, {'name': '蓝菇小虾包', 'conponent': ['小龙虾', '小麦', '蓝蘑菇'], 'rst': [80, 0, '0']}, {'name': '滑蛋牛柳', 'conponent': ['生鸡蛋', '生牛排'], 'rst': [45, 5, '0']}, {'name': '西红柿羊肉面', 'conponent': ['生羊排', '西红柿', '小麦'], 'rst': [60, 15, '0']}, {'name': '番茄鱼丸汤', 'conponent': ['鲤鱼', '西红柿'], 'rst': [40, 20, '0']}, {'name': '玉米猪排', 'conponent': ['生猪排', '玉米'], 'rst': [45, 25, '0']}, {'name': '猪排厚蛋烧', 'conponent': ['烤猪排', '生鸡蛋', '小麦'], 'rst': [65, 0, '0']}, {'name': '蘑菇猪排', 'conponent': ['烤猪排', '蘑菇'], 'rst': [55, 0, '0']}, {'name': '豆腐烧鲶鱼', 'conponent': ['鲶鱼', '黄豆'], 'rst': [40, 20, '0']}, {'name': '香酥鱼片', 'conponent': ['鲶鱼', '小麦'], 'rst': [45, -5, '0']}, {'name': '胡萝卜炒面', 'conponent': ['胡萝卜', '生鸡蛋'], 'rst': [60, 0, '0']}, {'name': '三文鱼通心粉', 'conponent': ['三文鱼', '小麦', '牛奶'], 'rst': [100, 30, '耐力I']}, {'name': '香炸龙虾球', 'conponent': ['小龙虾', '小麦'], 'rst': [80, -5, '0']}, {'name': '香炸蟹腿', 'conponent': ['大闸蟹', '小麦'], 'rst': [85, -5, '0']}, {'name': '香煎土豆饼', 'conponent': ['小麦', '土豆'], 'rst': [60, 0, '0']}, {'name': '培根土豆泥', 'conponent': ['土豆', '蘑菇'], 'rst': [60, 0, '0']}, {'name': '麻辣土豆丝', 'conponent': ['土豆', '辣椒'], 'rst': [65, 0, '0']}, {'name': '海带排骨汤', 'conponent': ['海带', '生猪排'], 'rst': [45, 40, '0']}, {'name': '海带蛋花汤', 'conponent': ['生鸡蛋', '海带'], 'rst': [35, 40, '0']}, {'name': '海带豆腐虾汤', 'conponent': ['海带', '黄豆', '小龙虾'], 'rst': [85, 40, '0']}, {'name': '西红柿炒蛋', 'conponent': ['生鸡蛋', '番茄'], 'rst': [45, 5, '0']}, {'name': '香蕉派', 'conponent': ['生鸡蛋', '小麦', '香蕉'], 'rst': [50, 0, '0']}, {'name': '双皮奶', 'conponent': ['牛奶', '生鸡蛋', '甘蔗'], 'rst': [50, 15, '0']}, {'name': '福源肉丸', 'conponent': ['生猪排', '胡椒', '小麦'], 'rst': [55, 0, '0']}, {'name': '口水鸡', 'conponent': ['生鸡腿', '黄豆', '菠菜'], 'rst': [55, 0, '0']}, {'name': '丝滑虾球', 'conponent': ['小龙虾', '甘蔗', '玉米'], 'rst': [70, 0, '0']}, {'name': '大牌卤肉', 'conponent': ['生猪排', '胡椒', '洋葱'], 'rst': [50, 0, '0']}, {'name': '小哈拉', 'conponent': ['小麦', '生鸡蛋', '黄豆'], 'rst': [50, 15, '0']}, {'name': '晨夕养生汤', 'conponent': ['菠菜', '海带', '胡萝卜'], 'rst': [50, 40, '0']}, {'name': '丝滑铁肘子', 'conponent': ['生猪排', '黄豆', '胡椒'], 'rst': [55, 0, '0']}, {'name': '大乱炖', 'conponent': ['生猪排', '生牛排', '生羊排'], 'rst': [50, 10, '0']}, {'name': '清蒸小童子鸡', 'conponent': ['生鸡腿', '胡萝卜', '胡椒'], 'rst': [50, 10, '0']}, {'name': '大鹏鸡腿', 'conponent': ['生鸡腿', '胡椒', '洋葱'], 'rst': [50, 0, '0']}, {'name': '肉松贝贝', 'conponent': ['生猪排', '小麦', '黄豆'], 'rst': [55, -5, '0']}, {'name': '咖喱**', 'conponent': ['洋葱', '胡椒', '**'], 'rst': [50, 0, '0']}, {'name': '港式菠萝包', 'conponent': ['烤猪排', '小麦', '蜂蜜'], 'rst': [70, 0, '0']}, {'name': '鲜虾酿豆腐', 'conponent': ['黄豆', '小龙虾', '蜂蜜'], 'rst': [70, 20, '0']}, {'name': '什锦河豚肉丁', 'conponent': ['玉米', '胡萝卜', '河豚'], 'rst': [50, 30, '0']}, {'name': '胡萝卜蟹肉烧', 'conponent': ['胡萝卜', '大闸蟹', '小麦'], 'rst': [70, 0, '0']}, {'name': '蜂蜜照烧鸡', 'conponent': ['蜂蜜', '甘蔗', '生鸡腿'], 'rst': [50, 10, '0']}, {'name': '芙蓉蟹肉', 'conponent': ['小龙虾', '生猪排', '帝王蟹'], 'rst': [70, 0, '0']}, {'name': '扇贝蒸蛋', 'conponent': ['扇贝', '生鸡蛋'], 'rst': [60, 20, '0']}, {'name': '松鼠桂鱼', 'conponent': ['蜂蜜', '桂鱼', '香蕉'], 'rst': [70, 0, '0']}, {'name': '鳗鱼饭', 'conponent': ['鳗鱼', '小麦'], 'rst': [75, 0, '0']}, {'name': '鲅鱼饺子', 'conponent': ['鲅鱼', '小麦'], 'rst': [80, 5, '0']}, {'name': '红烧红鲤鱼', 'conponent': ['红鲤鱼', '小麦'], 'rst': [80, 0, '0']}, {'name': '清蒸绿驴鱼', 'conponent': ['绿驴鱼', '土豆'], 'rst': [80, 0, '0']}, {'name': '金装水果乐园', 'conponent': ['西瓜', '草莓', '葡萄'], 'rst': [50, 40, '0']}, {'name': '鲜芋仙芋圆4号', 'conponent': ['红豆', '芋头'], 'rst': [60, 30, '0']}, {'name': '小贝披萨', 'conponent': ['小麦', '扇贝', '青椒'], 'rst': [35, 10, '0']}, {'name': '大贝披萨', 'conponent': ['小麦', '大扇贝', '青椒'], 'rst': [40, 10, '0']}, {'name': '炸洋葱圈', 'conponent': ['洋葱', '生鸡蛋', '番茄'], 'rst': [40, -10, '0']}, {'name': '可乐饼', 'conponent': ['土豆', '洋葱', '小麦'], 'rst': [40, -10, '0']}, {'name': '黑椒羊排', 'conponent': ['青椒', '烤羊排', '胡椒'], 'rst': [70, 0, '0']}, {'name': '黄焖鸡', 'conponent': ['蘑菇', '生鸡腿', '青椒'], 'rst': [60, 0, '0']}, {'name': '青椒炒蛋', 'conponent': ['青椒', '生鸡蛋'], 'rst': [40, 0, '0']}, {'name': '松仁玉米', 'conponent': ['松果', '玉米', '胡萝卜'], 'rst': [50, 5, '0']}, {'name': '酸汤桂鱼', 'conponent': ['桂鱼', '番茄', '蘑菇'], 'rst': [70, 15, '0']}, {'name': '蒲烧鳗鱼', 'conponent': ['鳗鱼', '洋葱', '甘蔗'], 'rst': [75, 0, '0']}, {'name': '西瓜沙冰', 'conponent': ['西瓜', '蜂蜜'], 'rst': [40, 30, '0']}, {'name': '蛋黄焗南瓜', 'conponent': ['南瓜', '烤鸡蛋'], 'rst': [55, 0, '0']}, {'name': '南瓜松饼', 'conponent': ['南瓜', '牛奶', '小麦'], 'rst': [55, 0, '0']}, {'name': '红豆糍粑', 'conponent': ['红豆', '烤南瓜', '小麦'], 'rst': [65, 0, '0']}, {'name': '黄金玉米烙', 'conponent': ['玉米', '小麦', '蜂蜜'], 'rst': [50, 0, '0']}, {'name': '麻婆豆腐', 'conponent': ['生猪排', '黄豆', '辣椒'], 'rst': [55, 0, '0']}, {'name': '巧克力曲奇', 'conponent': ['可可豆', '牛奶', '小麦'], 'rst': [50, 0, '0']}, {'name': '爆炒牛蛙', 'conponent': ['牛蛙', '洋葱', '青椒'], 'rst': [70, 0, '0']}, {'name': '蒸芋头', 'conponent': ['芋头', '甘蔗'], 'rst': [60, 20, '0']}, {'name': '芋头牛奶', 'conponent': ['芋头', '牛奶'], 'rst': [55, 40, '0']}, {'name': '蜜桃果茶', 'conponent': ['桃子', '苹果', '玫瑰茄'], 'rst': [40, 80, '0']}, {'name': '生姜果茶', 'conponent': ['生姜', '苹果', '玫瑰茄'], 'rst': [40, 80, '0']}, {'name': '香柠果茶', 'conponent': ['柠檬', '香茅', '苹果'], 'rst': [40, 80, '0']}, {'name': '蜜桔果茶', 'conponent': ['柑橘', '苹果', '香茅'], 'rst': [40, 80, '0']}, {'name': '糖醋带鱼', 'conponent': ['甘蔗', '带鱼'], 'rst': [40, 0, '0']}, {'name': '香煎带鱼', 'conponent': ['小麦', '带鱼', '洋葱'], 'rst': [55, 0, '0']}, {'name': '章鱼脚刺身', 'conponent': ['章鱼', '番茄'], 'rst': [40, 20, '0']}, {'name': '章鱼沙拉', 'conponent': ['章鱼', '土豆', '玉米'], 'rst': [50, 20, '0']}, {'name': '茄汁绿驴鱼', 'conponent': ['绿驴鱼', '番茄', '洋葱'], 'rst': [75, 0, '0']}, {'name': '红烧绿驴鱼', 'conponent': ['绿驴鱼', '小麦'], 'rst': [60, 0, '0']}, {'name': '红烧绿鲤鱼', 'conponent': ['绿鲤鱼', '小麦'], 'rst': [60, 0, '0']}, {'name': '清蒸绿鲤鱼', 'conponent': ['绿鲤鱼', '土豆', '生姜'], 'rst': [70, 20, '0']}, {'name': '苹果果酱', 'conponent': ['苹果*2'], 'rst': [40, 0, '0']}, {'name': '苹果塔', 'conponent': ['苹果', '小麦', '生鸡蛋'], 'rst': [60, 0, '0']}, {'name': '巧克力香蕉麦芬', 'conponent': ['香蕉', '小麦', '可可豆'], 'rst': [50, 0, '0']}, {'name': '葡萄果酱', 'conponent': ['葡萄*2'], 'rst': [40, 0, '0']}, {'name': '葡萄酒', 'conponent': ['葡萄', '甘蔗'], 'rst': [30, 40, '0']}, {'name': '葡萄酥', 'conponent': ['葡萄', '生鸡蛋', '小麦'], 'rst': [55, 0, '0']}, {'name': '小方酥', 'conponent': ['生鸡蛋', '牛奶', '小麦'], 'rst': [50, 0, '0']}, {'name': '番茄玉米羊汤', 'conponent': ['生羊排', '玉米', '番茄'], 'rst': [50, 35, '0']}, {'name': '扬州炒饭', 'conponent': ['玉米', '小龙虾', '土豆'], 'rst': [70, 0, '0']}, {'name': '爆米花', 'conponent': ['玉米', '甘蔗'], 'rst': [40, 0, '0']}, {'name': '西瓜牛奶', 'conponent': ['西瓜', '牛奶'], 'rst': [40, 30, '0']}, {'name': '四喜丸子', 'conponent': ['野味肉块', '胡椒', '鸡蛋'], 'rst': [55, 0, '0']}, {'name': '野味肉酱', 'conponent': ['野味肉块', '黄豆'], 'rst': [50, -10, '0']}, {'name': '牛肉酱', 'conponent': ['生牛排', '黄豆'], 'rst': [50, -10, '0']}, {'name': '八宝粥', 'conponent': ['红豆', '玉米', '甘蔗'], 'rst': [45, 20, '0']}, {'name': '拔丝苹果', 'conponent': ['苹果', '甘蔗'], 'rst': [40, 0, '0']}, {'name': '咖喱牛肉', 'conponent': ['洋葱', '土豆', '生牛排'], 'rst': [45, 0, '0']}, {'name': '野味肉酱面', 'conponent': ['野味肉块', '黄豆', '小麦'], 'rst': [50, 10, '0']}, {'name': '玫瑰茄酱', 'conponent': ['玫瑰茄', '甘蔗'], 'rst': [40, 0, '0']}, {'name': '洛神奶冻', 'conponent': ['玫瑰茄', '牛奶', '生鸡蛋'], 'rst': [50, 5, '0']}, {'name': '蜜桃果酱', 'conponent': ['桃子*2'], 'rst': [40, 0, '0']}, {'name': '黄桃牛奶', 'conponent': ['桃子', '牛奶'], 'rst': [40, 40, '0']}, {'name': '黄桃罐头', 'conponent': ['桃子', '甘蔗'], 'rst': [40, 15, '0']}, {'name': '柚子柠檬茶', 'conponent': ['柑橘', '柠檬', '蜂蜜'], 'rst': [50, 35, '0']}, {'name': '柠香蛋糕卷', 'conponent': ['生鸡蛋', '柠檬', '小麦'], 'rst': [50, 0, '0']}, {'name': '柠檬派', 'conponent': ['柠檬', '小麦', '甘蔗'], 'rst': [50, 0, '0']}, {'name': '泰式冬阴功汤', 'conponent': ['扇贝', '小龙虾', '香茅'], 'rst': [80, 50, '0']}, {'name': '海南鸡', 'conponent': ['生鸡腿', '香茅', '柠檬'], 'rst': [55, 0, '0']}, {'name': '柑橘罐头', 'conponent': ['柑橘', '甘蔗'], 'rst': [40, 20, '0']}, {'name': '柑橘可丽饼', 'conponent': ['柑橘', '牛奶', '小麦'], 'rst': [50, 0, '0']}, {'name': '柑橘可可蛋糕', 'conponent': ['柑橘', '可可豆', '小麦'], 'rst': [50, 0, '0']}, {'name': '姜糖饼干', 'conponent': ['生姜', '蜂蜜', '小麦'], 'rst': [50, 0, '0']}, {'name': '姜糖', 'conponent': ['生姜', '甘蔗'], 'rst': [40, 0, '0']}, {'name': '清蒸银鲳鱼', 'conponent': ['竹笋', '银鲳鱼', '土豆'], 'rst': [60, 30, '0']}, {'name': '老虎斑鱼锅', 'conponent': ['洋葱', '老虎斑鱼', '胡椒'], 'rst': [80, 10, '0']}, {'name': '青斑鱼锅', 'conponent': ['洋葱', '青斑鱼', '胡椒'], 'rst': [80, 10, '0']}, {'name': '东星斑鱼锅', 'conponent': ['洋葱', '东星斑鱼', '胡椒'], 'rst': [80, 10, '0']}, {'name': '清蒸小丑鱼', 'conponent': ['竹笋', '小丑鱼', '土豆'], 'rst': [60, 30, '0']}, {'name': '先秦肉夹馍', 'conponent': ['烤猪排', '小麦', '胡椒'], 'rst': [70, 0, '0']}, {'name': '红豆莲子羹', 'conponent': ['白莲', '小麦', '红豆'], 'rst': [30, 60, '祛热I']}, {'name': '辣子鸡丁', 'conponent': ['烤辣椒', '烤鸡腿'], 'rst': [60, 0, '御寒I']}, {'name': '辣炒带鱼', 'conponent': ['烤辣椒', '生姜', '带鱼'], 'rst': [90, 0, '0']}, {'name': '辣炒鳗鱼', 'conponent': ['烤辣椒', '生姜', '鳗鱼'], 'rst': [90, 0, '0']}, {'name': '辣炒鲅鱼', 'conponent': ['烤辣椒', '生姜', '鲅鱼'], 'rst': [90, 0, '0']}, {'name': '辣炒桂鱼', 'conponent': ['烤辣椒', '生姜', '桂鱼'], 'rst': [90, 0, '0']}, {'name': '辣炒鲤鱼', 'conponent': ['烤辣椒', '生姜', '鲤鱼'], 'rst': [90, 0, '0']}, {'name': '辣炒金枪鱼', 'conponent': ['烤辣椒', '生姜', '金枪鱼'], 'rst': [90, 0, '0']}, {'name': '辣炒鲶鱼', 'conponent': ['烤辣椒', '生姜', '鲶鱼'], 'rst': [90, 0, '0']}, {'name': '椒盐银鲳鱼', 'conponent': ['烤辣椒', '朝天椒', '银鲳鱼'], 'rst': [90, 0, '0']}, {'name': '奥尔良小烤', 'conponent': ['烤鸡腿', '烤羊排', '银鲳鱼'], 'rst': [90, 0, '0']}, {'name': '银鲳鱼鱼子酱', 'conponent': ['白莲', '银鲳鱼'], 'rst': [60, 0, '0']}, {'name': '一清二白', 'conponent': ['黄豆', '青斑鱼'], 'rst': [60, 0, '0']}, {'name': '南瓜起司烘蛋', 'conponent': ['南瓜', '生鸡蛋', '小麦'], 'rst': [70, 0, '0']}, {'name': '藤椒牛蛙', 'conponent': ['胡椒', '柠檬', '牛蛙'], 'rst': [70, 0, '0']}, {'name': '鱼香肉丝饭', 'conponent': ['烤猪排', '小麦', '东星斑鱼'], 'rst': [90, 0, '0']}, {'name': '西瓜汁', 'conponent': ['西瓜', '甘蔗'], 'rst': [0, 40, '0']}, {'name': '鸡蛋饼', 'conponent': ['小麦', '生鸡蛋'], 'rst': [45, 0, '0']}, {'name': '蓝莓果茶', 'conponent': ['玫瑰茄', '苹果', '蓝莓'], 'rst': [40, 80, '0']}, {'name': '草莓果茶', 'conponent': ['玫瑰茄', '苹果', '草莓'], 'rst': [40, 80, '0']}, {'name': '松子鱼汤', 'conponent': ['生姜', '松果', '青斑鱼'], 'rst': [70, 30, '0']}, {'name': '蜂蜜柠檬水', 'conponent': ['柠檬', '甘蔗', '蜂蜜'], 'rst': [30, 40, '0']}, {'name': '绝代三椒', 'conponent': ['胡椒', '辣椒', '青椒'], 'rst': [60, 0, '御寒I']}, {'name': '清凉水果汇', 'conponent': ['柠檬', '甘蔗', '苹果'], 'rst': [40, 50, '祛热I']}, {'name': '秘汁焗斑鱼', 'conponent': ['东星斑鱼', '烤鸡腿', '蜂蜜'], 'rst': [90, 0, '0']}, {'name': '酸汤斑鱼', 'conponent': ['东星斑鱼', '竹笋', '番茄'], 'rst': [60, 30, '0']}, {'name': '香煎银鲳鱼', 'conponent': ['银鲳鱼', '辣椒', '青椒'], 'rst': [90, 0, '0']}, {'name': '红烧银鲳鱼', 'conponent': ['银鲳鱼', '胡椒', '生姜'], 'rst': [60, 0, '0']}, {'name': '小丑鱼刺身', 'conponent': ['小丑鱼', '番茄', '柠檬'], 'rst': [60, 0, '0']}, {'name': '河豚刺身', 'conponent': ['河豚', '番茄', '柠檬'], 'rst': [60, 0, '0']}, {'name': '椰子煲鱼头', 'conponent': ['老虎斑鱼', '椰子', '生姜'], 'rst': [90, 0, '0']}, {'name': '蛋黄莲蓉月饼', 'conponent': ['生鸡蛋', '白莲', '小麦'], 'rst': [50, 0, '0']}, {'name': '芋头莲蓉月饼', 'conponent': ['芋头', '小麦', '白莲'], 'rst': [65, 0, '0']}, {'name': '蜜桃月饼', 'conponent': ['小麦', '玫瑰茄', '桃子'], 'rst': [50, 0, '0']}, {'name': '鸡蛋月饼', 'conponent': ['小麦', '玫瑰茄', '生鸡蛋'], 'rst': [50, 0, '0']}, {'name': '苹果月饼', 'conponent': ['小麦', '苹果', '玫瑰茄'], 'rst': [50, 0, '0']}, {'name': '翡翠月饼', 'conponent': ['小麦', '菠菜', '牛奶'], 'rst': [50, 0, '0']}, {'name': '巧克力月饼', 'conponent': ['小麦', '可可豆', '生鸡蛋'], 'rst': [50, 0, '0']}, {'name': '玉米月饼', 'conponent': ['小麦', '玉米', '南瓜'], 'rst': [50, 0, '0']}, {'name': '柑橘月饼', 'conponent': ['小麦', '甘蔗', '柑橘'], 'rst': [50, 0, '0']}, {'name': '火腿月饼', 'conponent': ['小麦', '玉米', '烤猪排'], 'rst': [65, 0, '0']}, {'name': '红豆月饼', 'conponent': ['小麦', '红豆', '甘蔗'], 'rst': [50, 0, '0']}, {'name': '水果月饼', 'conponent': ['小麦', '草莓', '苹果'], 'rst': [50, 0, '0']}, {'name': '葡萄月饼', 'conponent': ['小麦', '葡萄', '香茅'], 'rst': [50, 0, '0']}, {'name': '松果月饼', 'conponent': ['小麦', '松果', '香茅'], 'rst': [50, 0, '0']}, {'name': '柠檬蒸冰鱼', 'conponent': ['北极冰鱼', '辣椒', '柠檬'], 'rst': [60, 30, '0']}, {'name': '胡萝卜焖冰鱼', 'conponent': ['北极冰鱼', '胡萝卜'], 'rst': [60, 0, '0']}, {'name': '胡辣冰鱼汤', 'conponent': ['北极冰鱼', '胡椒', '辣椒'], 'rst': [45, 0, '御寒I']}, {'name': '红烧冰鱼', 'conponent': ['北极冰鱼', '辣椒', '生姜'], 'rst': [60, 0, '0']}, {'name': '玫瑰香蕉奶昔', 'conponent': ['玫瑰茄', '香蕉', '牛奶'], 'rst': [40, 40, '0']}, {'name': '玫瑰柠檬茶', 'conponent': ['玫瑰茄', '柠檬'], 'rst': [20, 60, '0']}, {'name': '土豆烧带鱼', 'conponent': ['带鱼', '土豆', '胡椒'], 'rst': [50, 0, '0']}, {'name': '翡翠东星斑', 'conponent': ['东星斑鱼', '菠菜'], 'rst': [50, 0, '0']}, {'name': '珠帘东星斑', 'conponent': ['东星斑鱼', '辣椒', '生鸡蛋'], 'rst': [75, 0, '0']}, {'name': '清蒸东星斑', 'conponent': ['东星斑鱼', '生姜'], 'rst': [65, 0, '0']}, {'name': '萝卜鲜贝汤', 'conponent': ['大扇贝', '生姜', '胡萝卜'], 'rst': [50, 30, '0']}, {'name': '扇贝意大利面', 'conponent': ['大扇贝', '小麦', '蘑菇'], 'rst': [50, 20, '0']}, {'name': '蘑菇炖河豚', 'conponent': ['河豚', '蘑菇', '生姜'], 'rst': [60, 20, '0']}, {'name': '炸河豚块', 'conponent': ['河豚', '胡椒'], 'rst': [55, 0, '0']}, {'name': '白莲牛汁汤', 'conponent': ['白莲', '生牛排', '胡萝卜'], 'rst': [40, 50, '0']}, {'name': '芙蓉菠菜汤', 'conponent': ['菠菜', '白莲'], 'rst': [50, 40, '0']}, {'name': '松鼠的小零食', 'conponent': ['冰河松果', '松果'], 'rst': [40, 0, '加速']}, {'name': '胡冰炒萝卜', 'conponent': ['老虎斑鱼', '胡萝卜'], 'rst': [60, 0, '0']}, {'name': '清蒸虎斑鱼', 'conponent': ['老虎斑鱼', '生姜'], 'rst': [60, 0, '0']}, {'name': '胡椒鲤鱼尾', 'conponent': ['鲤鱼', '胡椒'], 'rst': [50, 0, '0']}, {'name': '菠菜鲤鱼汤', 'conponent': ['鲤鱼', '菠菜'], 'rst': [45, 0, '0']}, {'name': '茄汁鲅鱼', 'conponent': ['鲅鱼', '番茄', '生姜'], 'rst': [70, 0, '0']}, {'name': '桃可豆奶茶', 'conponent': ['桃子', '牛奶', '可可豆'], 'rst': [30, 50, '0']}, {'name': '南瓜咖喱鸡', 'conponent': ['南瓜', '烤鸡腿', '烤蘑菇'], 'rst': [75, 0, '0']}, {'name': '水果沙拉', 'conponent': ['西瓜', '苹果', '桃子'], 'rst': [50, 0, '0']}, {'name': '肉酱土豆泥', 'conponent': ['牛奶', '土豆', '烤猪排'], 'rst': [130, 0, '0']}, {'name': '清蒸大龙虾', 'conponent': ['番茄', '烤南瓜', '大龙虾'], 'rst': [100, 0, '血气I']}, {'name': '蟹肉宴', 'conponent': ['帝王蟹', '大闸蟹', '珍珠'], 'rst': [100, 0, '耐力I']}, {'name': '麻辣小龙虾', 'conponent': ['烤辣椒', '小龙虾'], 'rst': [80, 0, '0']}, {'name': '烤鸡蛋布丁', 'conponent': ['烤鸡蛋', '牛奶'], 'rst': [60, 10, '0']}, {'name': '蔬菜串烧', 'conponent': ['烤玉米', '烤香蕉', '烤苹果'], 'rst': [85, 0, '0']}, {'name': '龙虾小丸子', 'conponent': ['小麦', '大龙虾'], 'rst': [80, 0, '耐力I']}, {'name': '蘑菇大虾包', 'conponent': ['大龙虾', '小麦', '蘑菇'], 'rst': [105, 0, '耐力II']}, {'name': '红菇大虾包', 'conponent': ['大龙虾', '小麦', '红蘑菇'], 'rst': [150, 0, '御寒II']}, {'name': '蓝菇大虾包', 'conponent': ['大龙虾', '小麦', '蓝蘑菇'], 'rst': [105, 0, '祛热II']}, {'name': '香辣小龙虾', 'conponent': ['小龙虾', '辣椒'], 'rst': [85, 0, '0']}, {'name': '虾兵蟹将', 'conponent': ['小龙虾', '大闸蟹'], 'rst': [110, 0, '耐力I']}, {'name': '问政山笋', 'conponent': ['竹笋', '蘑菇', '洋葱'], 'rst': [105, 0, '耐力I']}, {'name': '吉利虾', 'conponent': ['大龙虾', '胡椒', '洋葱'], 'rst': [105, 0, '血气I']}, {'name': '翻水象拔蚌', 'conponent': ['象拔蚌', '胡萝卜', '海带'], 'rst': [105, 60, '耐力I']}, {'name': '多汁鲍鱼', 'conponent': ['鲍鱼', '南瓜', '蜂蜜'], 'rst': [105, 60, '耐力I']}, {'name': '麻辣桂鱼', 'conponent': ['青椒', '桂鱼'], 'rst': [80, 0, '0']}, {'name': '红鲤鱼与绿鲤鱼', 'conponent': ['绿鲤鱼', '红鲤鱼'], 'rst': [85, 30, '0']}, {'name': '辛香汇钵钵鸡', 'conponent': ['生鸡腿', '辣椒', '胡椒'], 'rst': [100, 0, '御寒I']}, {'name': '辛香汇水煮鱼', 'conponent': ['鲶鱼', '辣椒', '胡椒'], 'rst': [100, 0, '御寒I']}, {'name': '辛香汇馋嘴牛蛙', 'conponent': ['辣椒', '胡椒', '牛蛙'], 'rst': [105, 0, '御寒I']}, {'name': '拔蚌披萨', 'conponent': ['小麦', '象拔蚌', '青椒'], 'rst': [105, 0, '耐力I']}, {'name': '鱼头泡饼', 'conponent': ['绿驴鱼', '鲅鱼', '小麦'], 'rst': [80, 35, '0']}, {'name': '荷花鱼翅', 'conponent': ['白莲', '鲅鱼', '菠菜'], 'rst': [80, 50, '0']}, {'name': '笋酿', 'conponent': ['竹笋', '蘑菇', '生猪排'], 'rst': [105, 0, '耐力I']}, {'name': '象拔蚌刺身', 'conponent': ['象拔蚌', '番茄'], 'rst': [100, 20, '0']}, {'name': '蛤仔煎', 'conponent': ['象拔蚌', '生鸡蛋', '胡椒'], 'rst': [105, 30, '血气I']}, {'name': '鲍鱼捞饭', 'conponent': ['鲍鱼', '蘑菇', '胡萝卜'], 'rst': [105, 50, '耐力I']}, {'name': '象拔蚌捞饭', 'conponent': ['象拔蚌', '蘑菇', '胡萝卜'], 'rst': [105, 50, '血气I']}, {'name': '川椒鲤鱼', 'conponent': ['红鲤鱼', '绿鲤鱼', '辣椒'], 'rst': [90, 0, '0']}, {'name': '葡萄奶酥', 'conponent': ['葡萄', '牛奶', '生鸡蛋'], 'rst': [50, 0, '0']}, {'name': '蜜汁鸡腿', 'conponent': ['烤鸡腿', '蜂蜜'], 'rst': [60, 0, '0']}, {'name': '芝士焗蟹', 'conponent': ['帝王蟹', '牛奶', '蜂蜜'], 'rst': [80, 0, '0']}, {'name': '牛蛙煲', 'conponent': ['牛蛙', '竹笋', '洋葱'], 'rst': [105, 0, '耐力I']}, {'name': '干锅牛蛙', 'conponent': ['牛蛙', '竹笋', '土豆'], 'rst': [105, 0, '耐力I']}, {'name': '芋头烧带鱼', 'conponent': ['芋头', '带鱼', '青椒'], 'rst': [80, 0, '0']}, {'name': '爆炒鱿鱼', 'conponent': ['章鱼', '青椒', '洋葱'], 'rst': [70, 0, '0']}, {'name': '椒香牛柳', 'conponent': ['辣椒', '生牛排', '胡椒'], 'rst': [105, 0, '御寒I']}, {'name': '柠檬鸡', 'conponent': ['柠檬', '生鸡腿', '辣椒'], 'rst': [105, 0, '御寒I']}, {'name': '香茅酱', 'conponent': ['香茅', '生姜', '朝天椒'], 'rst': [105, 0, '耐力I']}, {'name': '清蒸大虾', 'conponent': ['生姜', '胡椒', '大龙虾'], 'rst': [70, 0, '0']}, {'name': '松露玉簪虾球', 'conponent': ['松露', '小麦', '小龙虾'], 'rst': [100, 0, '0']}, {'name': '淘汰郎火锅', 'conponent': ['生牛排', '菠菜', '辣椒'], 'rst': [60, 0, '0']}, {'name': '芙蓉冰鱼片', 'conponent': ['北极冰鱼', '白莲'], 'rst': [40, 50, '0']}, {'name': '清蒸冰鱼', 'conponent': ['北极冰鱼', '白莲', '生姜'], 'rst': [70, 20, '0']}, {'name': '浪花东星斑', 'conponent': ['东星斑鱼', '青椒', '辣椒'], 'rst': [65, 0, '御寒I']}, {'name': '芙蓉虎星斑', 'conponent': ['老虎斑鱼', '东星斑鱼', '白莲'], 'rst': [85, 0, '0']}, {'name': '清蒸帝王蟹', 'conponent': ['帝王蟹', '生姜'], 'rst': [90, 0, '0']}, {'name': '香辣帝王蟹', 'conponent': ['帝王蟹', '生姜', '辣椒'], 'rst': [90, 0, '0']}, {'name': '剁椒蒸带鱼', 'conponent': ['青椒', '带鱼', '竹笋'], 'rst': [105, 0, '御寒II']}, {'name': '肉蟹煲', 'conponent': ['帝王蟹', '生鸡腿', '朝天椒'], 'rst': [135, 0, '祛热II']}, {'name': '豪华盛宴', 'conponent': ['红莲', '象拔蚌', '精灵鱼'], 'rst': [180, 180, '0']}, {'name': '魔法怪味豆', 'conponent': ['洋葱', '胡椒', '黄豆'], 'rst': [0, 0, '随机buff']}, {'name': '帝王琵琶锅', 'conponent': ['帝王蟹', '生姜', '大龙虾'], 'rst': [105, 0, '御寒I']}, {'name': '菌菇灵鱼汤', 'conponent': ['精灵鱼', '蘑菇', '竹笋'], 'rst': [220, 50, '攻击I']}, {'name': '靓肤彩莲汤', 'conponent': ['白莲', '红莲', '蓝莲'],'rst': [260, 0, '防御I，攻击I']}],
    current_vegs:[],
    abc:[],
    btn_sub_fish:['桂鱼', '绿驴鱼', '青斑鱼','带鱼','章鱼','鲍鱼','三文鱼', '老虎斑鱼','小丑鱼','海带', '小龙虾', '象拔蚌','鲅鱼','鳗鱼','绿鲤鱼','北极冰鱼', '精灵鱼', '大闸蟹','红鲤鱼', '牛蛙','烤章鱼','银鲳鱼', '扇贝','东星斑鱼','鲤鱼','大龙虾', '帝王蟹','金枪鱼', '鲶鱼', '小扇贝','珍珠','大扇贝',],
    btn_sub_meat:['烤羊排','烤野味','生羊排','饲喂肉块','烤牛排','生鸡腿','生牛排','烤猪排','野味肉块','烤鸡腿','生猪排',],

    btn_sub_fruit:['烤苹果','桃子','西瓜', '柠檬', '椰子','烤香蕉','草莓','苹果','葡萄', '柑橘', '甘蔗','蓝莓','香蕉','蓝蘑菇', '胡萝卜','红蘑菇', '小麦', ],
    btn_sub_vegetable:['西红柿','香茅', '烤南瓜', '洋葱','青椒', '番茄','胡椒', '芋头', '可可豆','土豆','烤辣椒',  '松果',  '烤玉米','冰河松果', '菠菜','生姜','辣椒','黄豆', '红豆','玉米', '南瓜','竹笋','朝天椒','向日葵种子'],
    btn_sub_siliao:['土豆饲料', '黄豆饲料',  '胡萝卜饲料','辣椒饲料' ],
    btn_sub_lianhua:['蓝莲','红莲' ,'白莲'],
    
    btn_name:[ '饲料' , '蘑菇', '松露', '生鸡蛋',  '牛奶',  '蜂蜜', '小麦饲料', '烤鸡蛋',   '鸡蛋',  '玫瑰茄', '烤蘑菇', ]
  
 
  },
  sub_fish:function(){
    this.setData({
      abc:this.data.btn_sub_fish
    })
  
  },
  sub_meat:function(){
    this.setData({
      abc:this.data.btn_sub_meat
    })
    
    },
    
  sub_fruit:function(){
    this.setData({
      abc:this.data.btn_sub_fruit
    })
  },
  sub_vegetable:function(){
    this.setData({
      abc:this.data.btn_sub_vegetable
    })
  },
  sub_siliao:function(){
    this.setData({
      abc:this.data.btn_sub_siliao
    })
  },
  sub_lianhua:function(){
    this.setData({
      abc:this.data.btn_sub_lianhua
    })
  },
  select_veg:function(e)
  {
    console.log(e);
    var veg_name=e.currentTarget.dataset.veg;
    console.log(veg_name)
    var result=[]
    this.setData({
      current_vegs:result
    })
    for(var index in this.data.vegs)
    {
      var veg=this.data.vegs[index]
      var conponents=this.data.vegs[index].conponent
      for(var i in conponents)
      {
        if(conponents[i]==veg_name)
        {
          result.push(veg)  
        }
      }
      this.setData({
        current_vegs:result
      })
      
    }
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})